---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.HasNoValue
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.HasNoValue

The element does not have a value for the specified parameter. No value is specified.